Microsoft
мы на уроке проходили Microsoft и его создателя Бил Гейтса
Компания начала свою историю в 1975 году, когда друзья-студенты Гарварда Билл Гейтс и Пол Аллен, прочитав опубликованную 1 января 1975 года
в журнале Popular Electronics статью о новом персональном компьютере Altair 8800, разработали для него интерпретатор языка Basic. 
Через месяц, 1 февраля, было подписано лицензионное соглашение с компанией Micro Instrumentation and Telemetry Systems (MITS), производителем этого ПК,
об использовании Basic в составе ПО для Altair. Свою компанию они думали назвать «Аллен и Гейтс», но посчитали, что это больше подходит для юридической конторы,
и тогда Пол предложил — «Micro-Soft», от «microcomputer» и «software»[13]. Свой первый год новая компания, в которой работало три человека, закончила с оборотом 16 005 $.
(для сравнения: в 2000 году выручка корпорации составила 25,3 млрд $, а прибыль — более 7,3 млрд $). В 1977 году Microsoft BASIC был лицензирован компаниям Apple и Radio Shack; 
в том же году был разработан интерпретатор для языка FORTRAN, а в 1978 году — для COBOL[14].
В 1984 году Microsoft разработала программное обеспечение (интерпретатор Basic, Word, электронные таблицы Multiplan) для нового компьютера Apple Macintosh, благодаря чему выручка за этот год достигла 100 млн долларов
Так 20 ноября 1985 года появилась новая операционная система Microsoft Window В том же году была выпущена программа Excel, улучшенная модификация электронных таблиц Multiplan[14].
 В 1989 году состоялся первый выпуск пакета офисных приложений Microsoft Office. 1990 год компания закончила с выручкой 1 млрд долларов и 5600 сотрудников 29 июня 2015 года вышла Windows 10.
Билл Гейтс родился 28 октября 1955 года, в городе Сиэтл (штат Вашингтон, США). Его отец — адвокат Уильям Генри Гейтс I
