История
Одноимённая компания, разрабатывающая сервис, была основана в 2012 году Диланом Филдом[1][2][3][4][5]; в 2013 году привлекла $3,8 млн, к 2015 году инвестиции в проект составили $14 млн[6]. В начале 2018 года удалось привлечь дополнительные $25 млн[7].

К началу 2019 года Figma вышла на 1 миллион зарегистрированных пользователей[8]. В 2019 году создатели редактора привлекли $40 млн от венчурного фонда Sequoia Capital, оценочная стоимость бизнеса составила 400 млн долл. В 2020 году компания привлекла 50 млн долл., 
остигнув оценки капитализации в 2 млрд долл.[9][10]

В сентябре 2022 года корпорация Adobe объявила о достижении договорённости о покупке Figma за $20 млрд при сохранении компанией самостоятельности[11].
Но в декабре 2023 года Adobe отказалась от покупки Figma из-за проблем с получением разрешений от антимонопольных регуляторов Евросоюза и Великобритании[12
